Tekla Open API Reference for Tekla Structures 2025
String Implicit Conversion (String to String)
 Converts from Datatype.String to string.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static implicit operator string (
	String From
)
Public Shared Widening Operator CType (
	From As String
) As String
Parameters
From
Type: Tekla.Structures.Datatype.String
The value to be converted.
Return Value
Type: String
The converted string value.
See Also
Reference
String Structure
Implicit Overload
Tekla.Structures.Datatype Namespace